var posDailyAveData_xxx = function (year, month) {
    var arr = new Array(), retValue = new Array(), daysInMonth = getDaysInMonth(year, month);
    for (var i = 0; i < posList.length ; i++) {
        var ar = posDataD.filter(function (v) {
            return (v["点位编码"] == posList[i]["编码"] && v["Month"] == month);
        });
        arr.push(ar);
    }
    for (var i = 0; i < daysInMonth; i++) {
        var total = 0, validPos = 0;
        for (var j = 0; j < arr.length; j++) {
            if (typeof arr[j][i] != "undefined" && typeof arr[j][i]["监测值"] != "undefined") {
                total += parseFloat(arr[j][i]["监测值"]);
                ++validPos;
            }
        }
        retValue.push({ day: (i + 1), value: (validPos == 0 ? null : total / validPos) });
    }
    return retValue;
}


var industryMonthData_xxxx = function (year, month) {
    var industryTotalArr = [], monthString = month.toString(), allTotal = 0, percent = 0;
    industryType.forEach(function (value, index, array) {
        var total = 0;
        companyMonthData.filter(function (v) {
            return v["行业"] == value;
        }).forEach(function (val, ind, arr) {
            val["月数据"].forEach(function (v, i, ar) {
                if (v["月份"] == monthString) {
                    total += parseFloat(v["月平均排放量"]);
                }
            });
        });
        allTotal += total;
        industryTotalArr.push({ "行业": value, "月排放量": total });
    });
    industryTotalArr.sort(function (a, b) {
        return a["月排放量"] >= b["月排放量"] ? -1 : 1;
    }).forEach(function (value, index, array) {
        if (index != array.length - 1) {
            var per = value["月排放量"] / allTotal;
            percent += per;
            value["月排放比例"] = per;
        } else {
            value["月排放比例"] = 1 - percent;
        }
    });
    return industryTotalArr;
}

var posMonthDetailData_xxx = function (posName, year, month) {
    function getPosName(posId) {
        var posName;
        for (var i = 0; i < posList.length; i++) {
            if (posId == posList[i]["编码"]) {
                posName = posList[i]["站点名称"];
                break;
            }
        }
        return posName;
    }

    var arr = new Array(), retValue = new Array(), daysInMonth = getDaysInMonth(year, month);
    var ar = posList.filter(function (v) {
        return v["站点名称"] == posName;
    });

    if (ar.length == 0) {
        return null;
    } else {
        var posCode = ar[0]["编码"];
        var tempArr = posDataH.filter(function (v) {
            var time = v["MonitorTime"];
            var date = new Date(time.split(" ")[0]);
            return v["点位编码"] == posCode && date.getFullYear() == year && date.getMonth() + 1 == month;
        });
        for (var i = 0; i < daysInMonth; i++) {
            var day = i + 1, value = null;
            var arrx = tempArr.filter(function (val) {
                var t = val["MonitorTime"];
                var d = new Date(t.split(" ")[0]);
                return d.getDate() == day && d.getDate() <= 27;
            });
            if (arrx.length > 0) {
                if (getPosName(arrx[0]["点位编码"]) == "道外承德广场" || getPosName(arrx[0]["点位编码"]) == "岭北" || getPosName(arrx[0]["点位编码"]) == "道里建国街" || getPosName(arrx[0]["点位编码"]) == "松北商大") {
                    value = null;
                }
                else {
                    value = parseFloat(arrx[0]["监测值"] == "" ? 0 : arrx[0]["监测值"]);
                }
            }
            retValue.push({ day: day, value: value });
        }
        return retValue;
    }
}


var comMonthDetailData_xxxx = function (comName, year, month) {
    var arr = new Array(), retValue = new Array(), daysInMonth = getDaysInMonth(year, month);
    var ar = comList.filter(function (v) {
        return v["企业名称"] == comName;
    });

    if (ar.length == 0) {
        return null;
    } else {
        var comCode = ar[0]["企业编码"];
        var tempArr = comDataD.filter(function (v) {
            var d = new Date(v["Time"].split(' ')[0]);
            return v["企业编码"] == comCode && d.getFullYear() == year && d.getMonth() + 1 == month;
        });
        for (var i = 0; i < daysInMonth; i++) {
            var day = i + 1, value = null;
            var arrx = tempArr.filter(function (val) {
                var d = new Date(val["Time"].split(' ')[0]);
                return d.getDate() == day;
            });
            if (arrx.length > 0) {
                var total = 0;
                arrx.forEach(function (vv, ii, aarr) {
                    total += parseFloat(vv["累计排放量"]);
                });
                value = total;
            }
            retValue.push({ day: day, value: value });
        }
        return retValue;
    }
}


var comMonthTotalVal_xxx = function (year, month) {
    var arr = new Array(), retValue = new Array(), comName;
    comList.forEach(function (value, index, array) {
        var ar = comDataD.filter(function (v) {
            var date = new Date(v["Time"].split(' ')[0]);
            return v["企业编码"] == value["企业编码"] && date.getFullYear() == year && date.getMonth() + 1 == month;
        });
        var total = 0;
        comName = value["企业名称"];
        ar.forEach(function (v, i, arr) {
            total += Math.ceil(parseFloat(v["累计排放量"] == "" ? 0 : v["累计排放量"]));
        });
        retValue.push({ "企业名称": comName, "月份": month, "月排放总量": total });
    });
    return retValue;
}


var companyMonthData_xx = [
    { "企业名称": "鑫玛热电(木兰)", "企业编码": "150100000008", "行业": "电厂", "排放总量": 50120397.31599997, "月数据": [{ "月份": "1", "月平均排放量": "128348.78155000001" }, { "月份": "2", "月平均排放量": "136453.38853448277" }, { "月份": "3", "月平均排放量": "117991.61563934426" }, { "月份": "4", "月平均排放量": "68284.28575" }, { "月份": "5", "月平均排放量": "52783.01051612903" }, { "月份": "6", "月平均排放量": "72280.64378333335" }, { "月份": "7", "月平均排放量": "77364.52896551725" }, { "月份": "8", "月平均排放量": "86888.486225" }, { "月份": "9", "月平均排放量": "70258.69664285717" }, { "月份": "10", "月平均排放量": "51320.9399117647" }, { "月份": "11", "月平均排放量": "36221.85108474576" }, { "月份": "12", "月平均排放量": "49825.28657407408" }] },
    { "企业名称": "西林钢铁", "企业编码": "150100000013", "行业": "钢铁", "排放总量": 11128813.964000003, "月数据": [{ "月份": "1", "月平均排放量": "52686.16090322579" }, { "月份": "2", "月平均排放量": "32704.999258620697" }, { "月份": "3", "月平均排放量": "29216.981183333333" }, { "月份": "4", "月平均排放量": "13516.811305084747" }, { "月份": "5", "月平均排放量": "6367.510338709678" }, { "月份": "6", "月平均排放量": "6696.666399999999" }, { "月份": "7", "月平均排放量": "8201.209156862745" }, { "月份": "8", "月平均排放量": "7107.335016666666" }, { "月份": "9", "月平均排放量": "12216.679913793106" }, { "月份": "10", "月平均排放量": "10028.027593750001" }, { "月份": "11", "月平均排放量": "15272.549283333333" }, { "月份": "12", "月平均排放量": "20361.55568518519" }] },
    { "企业名称": "地丰涤纶", "企业编码": "150100000022", "行业": "化工", "排放总量": 533620718.48299884, "月数据": [{ "月份": "1", "月平均排放量": "115765.60203614465" }, { "月份": "2", "月平均排放量": "143144.27633984372" }, { "月份": "3", "月平均排放量": "125287.47817028989" }, { "月份": "4", "月平均排放量": "122315.93085333332" }, { "月份": "5", "月平均排放量": "169383.0250179212" }, { "月份": "6", "月平均排放量": "194814.8140588236" }, { "月份": "7", "月平均排放量": "276578.04328571446" }, { "月份": "8", "月平均排放量": "327476.47395053" }, { "月份": "9", "月平均排放量": "149952.655011811" }, { "月份": "10", "月平均排放量": "193955.55832089556" }, { "月份": "11", "月平均排放量": "313418.651372694" }, { "月份": "12", "月平均排放量": "184195.0395930737" }] },
    { "企业名称": "鑫玛热电(宾县)", "企业编码": "150100000033", "行业": "电厂", "排放总量": 719288749.5189998, "月数据": [{ "月份": "1", "月平均排放量": "245.50539024390252" }, { "月份": "2", "月平均排放量": "597.6042347826085" }, { "月份": "3", "月平均排放量": "553.2413750000002" }, { "月份": "4", "月平均排放量": "915329.2857843138" }, { "月份": "5", "月平均排放量": "886125.5400655733" }, { "月份": "6", "月平均排放量": "466408.83528301894" }, { "月份": "7", "月平均排放量": "747849.5724601769" }, { "月份": "8", "月平均排放量": "1039854.2251150443" }, { "月份": "9", "月平均排放量": "598777.1750265486" }, { "月份": "10", "月平均排放量": "1884324.74153125" }, { "月份": "11", "月平均排放量": "651810.3517310921" }, { "月份": "12", "月平均排放量": "1102706.5090480768" }] },
    { "企业名称": "宾州水泥", "企业编码": "150100000042", "行业": "水泥", "排放总量": 69769617.75199997, "月数据": [{ "月份": "1", "月平均排放量": "0" }, { "月份": "2", "月平均排放量": "0" }, { "月份": "3", "月平均排放量": "0" }, { "月份": "4", "月平均排放量": "87045.41945762711" }, { "月份": "5", "月平均排放量": "88650.4734516129" }, { "月份": "6", "月平均排放量": "74429.42255357142" }, { "月份": "7", "月平均排放量": "83037.39206034476" }, { "月份": "8", "月平均排放量": "68156.06547580646" }, { "月份": "9", "月平均排放量": "67072.46671962618" }, { "月份": "10", "月平均排放量": "120327.45324561404" }, { "月份": "11", "月平均排放量": "103155.77864957273" }, { "月份": "12", "月平均排放量": "128569.65372222218" }] },
    { "企业名称": "哈尔滨第三发电厂", "企业编码": "150200000001", "行业": "电厂", "排放总量": 17367146502.155, "月数据": [{ "月份": "1", "月平均排放量": "273336.42091228073" }, { "月份": "2", "月平均排放量": "257763.0603853211" }, { "月份": "3", "月平均排放量": "33368.999556451614" }, { "月份": "4", "月平均排放量": "93005.17170689655" }, { "月份": "5", "月平均排放量": "157141.81074999997" }, { "月份": "6", "月平均排放量": "145490.56748936168" }, { "月份": "7", "月平均排放量": "202171.70534745752" }, { "月份": "8", "月平均排放量": "28857104.088068965" }, { "月份": "9", "月平均排放量": "138537052.36721277" }, { "月份": "10", "月平均排放量": "23971772.042245283" }, { "月份": "11", "月平均排放量": "0" }, { "月份": "12", "月平均排放量": "685821.8517450981" }] },
    { "企业名称": "中龙热电", "企业编码": "150200000003", "行业": "电厂", "排放总量": 2104126776.9869992, "月数据": [{ "月份": "1", "月平均排放量": "2107760.1647894727" }, { "月份": "2", "月平均排放量": "1161451.3175370374" }, { "月份": "3", "月平均排放量": "242296.51945528455" }, { "月份": "4", "月平均排放量": "435584.3866666667" }, { "月份": "5", "月平均排放量": "3126157.593431034" }, { "月份": "6", "月平均排放量": "3045712.305358974" }, { "月份": "7", "月平均排放量": "2398224.7279541297" }, { "月份": "8", "月平均排放量": "2717355.226262297" }, { "月份": "9", "月平均排放量": "1636331.3789374991" }, { "月份": "10", "月平均排放量": "2481374.4845000002" }, { "月份": "11", "月平均排放量": "0" }, { "月份": "12", "月平均排放量": "3446957.5113146063" }] },
    { "企业名称": "哈药集团制药总厂", "企业编码": "150200000009", "行业": "医药", "排放总量": 630320746.8749999, "月数据": [{ "月份": "1", "月平均排放量": "401638.5152474748" }, { "月份": "2", "月平均排放量": "445044.28981318703" }, { "月份": "3", "月平均排放量": "68248.07696618356" }, { "月份": "4", "月平均排放量": "180628.96693867922" }, { "月份": "5", "月平均排放量": "335207.81054386" }, { "月份": "6", "月平均排放量": "321256.36893449793" }, { "月份": "7", "月平均排放量": "478657.87073180085" }, { "月份": "8", "月平均排放量": "336188.3468917912" }, { "月份": "9", "月平均排放量": "230499.89104026847" }, { "月份": "10", "月平均排放量": "123872.05246913578" }, { "月份": "11", "月平均排放量": "41542.586739583334" }, { "月份": "12", "月平均排放量": "182136.66981355933" }] },
    { "企业名称": "中煤龙化（煤化工）", "企业编码": "150200000012", "行业": "化工", "排放总量": 480272903.03599995, "月数据": [{ "月份": "1", "月平均排放量": "477044.3368" }, { "月份": "2", "月平均排放量": "494280.87110982654" }, { "月份": "3", "月平均排放量": "69341.12113227513" }, { "月份": "4", "月平均排放量": "133606.68469613258" }, { "月份": "5", "月平均排放量": "163011.43227586214" }, { "月份": "6", "月平均排放量": "49806.6826935484" }, { "月份": "7", "月平均排放量": "400577.78002890176" }, { "月份": "8", "月平均排放量": "283552.4533221153" }, { "月份": "9", "月平均排放量": "434145.50049484527" }, { "月份": "10", "月平均排放量": "121235.55396621619" }, { "月份": "11", "月平均排放量": "50183.510024539886" }, { "月份": "12", "月平均排放量": "56298.89114285714" }] },
    { "企业名称": "东安发动机", "企业编码": "150200000013", "行业": "机械", "排放总量": 1427987430.7429974, "月数据": [{ "月份": "1", "月平均排放量": "737779.1676279068" }, { "月份": "2", "月平均排放量": "694604.9505317075" }, { "月份": "3", "月平均排放量": "88503.76051101321" }, { "月份": "4", "月平均排放量": "389112.82564351853" }, { "月份": "5", "月平均排放量": "628954.4533285716" }, { "月份": "6", "月平均排放量": "667015.1299404261" }, { "月份": "7", "月平均排放量": "564376.3685308057" }, { "月份": "8", "月平均排放量": "1010545.5800295357" }, { "月份": "9", "月平均排放量": "541212.3157675441" }, { "月份": "10", "月平均排放量": "566798.5832602041" }, { "月份": "11", "月平均排放量": "621757.8312142857" }, { "月份": "12", "月平均排放量": "632454.5662523803" }] },
    { "企业名称": "哈尔滨第一热电厂", "企业编码": "150200000014", "行业": "医药", "排放总量": 427412183.475, "月数据": [{ "月份": "1", "月平均排放量": "420757.7769189188" }, { "月份": "2", "月平均排放量": "390470.689855856" }, { "月份": "3", "月平均排放量": "92401.7626111111" }, { "月份": "4", "月平均排放量": "155353.16595535717" }, { "月份": "5", "月平均排放量": "489609.658948276" }, { "月份": "6", "月平均排放量": "532891.123736842" }, { "月份": "7", "月平均排放量": "455309.6626181818" }, { "月份": "8", "月平均排放量": "450158.4937583332" }, { "月份": "9", "月平均排放量": "298390.6199324323" }, { "月份": "10", "月平均排放量": "298897.7401714285" }, { "月份": "11", "月平均排放量": "451317.8788800001" }, { "月份": "12", "月平均排放量": "583494.6340374999" }] },
    { "企业名称": "东方热电", "企业编码": "150200000056", "行业": "电厂", "排放总量": 16341211.977999994, "月数据": [{ "月份": "6", "月平均排放量": "158374.97400000002" }, { "月份": "7", "月平均排放量": "139418.19246000002" }, { "月份": "8", "月平均排放量": "51896.70848148147" }, { "月份": "9", "月平均排放量": "33542.72445614035" }, { "月份": "10", "月平均排放量": "52800.06876363637" }, { "月份": "11", "月平均排放量": "53200.670791666664" }, { "月份": "12", "月平均排放量": "13448.353558139533" }] },
    { "企业名称": "哈飞工业集团", "企业编码": "150300000012", "行业": "机械", "排放总量": 3513674057.512004, "月数据": [{ "月份": "1", "月平均排放量": "66719.38316666665" }, { "月份": "2", "月平均排放量": "63679524.27385453" }, { "月份": "3", "月平均排放量": "47763.24414814812" }, { "月份": "4", "月平均排放量": "11709.039659574466" }, { "月份": "5", "月平均排放量": "0.05651851851851851" }, { "月份": "6", "月平均排放量": "0.014016666666666672" }, { "月份": "7", "月平均排放量": "2036.268982758621" }, { "月份": "8", "月平均排放量": "14813.83327272727" }, { "月份": "9", "月平均排放量": "15632.362616666669" }, { "月份": "10", "月平均排放量": "19513.066444444452" }, { "月份": "11", "月平均排放量": "23229.488155172414" }, { "月份": "12", "月平均排放量": "41528.05119607842" }] },
    { "企业名称": "哈投热电厂", "企业编码": "150300000017", "行业": "电厂", "排放总量": 171055748.66699994, "月数据": [{ "月份": "1", "月平均排放量": "82800.69053521126" }, { "月份": "2", "月平均排放量": "1122616.708478261" }, { "月份": "3", "月平均排放量": "96622.96053086417" }, { "月份": "4", "月平均排放量": "115698.04460000001" }, { "月份": "5", "月平均排放量": "359979.9477374999" }, { "月份": "6", "月平均排放量": "138979.01836144575" }, { "月份": "7", "月平均排放量": "98909.75996629211" }, { "月份": "8", "月平均排放量": "104380.63701449273" }, { "月份": "9", "月平均排放量": "111446.47145000002" }, { "月份": "10", "月平均排放量": "67931.49055" }, { "月份": "11", "月平均排放量": "7477.257071428572" }, { "月份": "12", "月平均排放量": "16652069.792112361" }] },
    { "企业名称": "达尔凯阳光（哈尔滨）", "企业编码": "150300000018", "行业": "电厂", "排放总量": 25212586.850000005, "月数据": [{ "月份": "1", "月平均排放量": "91164.73325000002" }, { "月份": "2", "月平均排放量": "106423.53519298244" }, { "月份": "3", "月平均排放量": "49348.021944444445" }, { "月份": "4", "月平均排放量": "62982.101059999986" }, { "月份": "5", "月平均排放量": "23667.385543478263" }, { "月份": "6", "月平均排放量": "24423.757366666665" }, { "月份": "7", "月平均排放量": "23586.71235714285" }, { "月份": "8", "月平均排放量": "34019.421" }, { "月份": "9", "月平均排放量": "11658.997600000002" }, { "月份": "10", "月平均排放量": "16140.565705882356" }, { "月份": "11", "月平均排放量": "23078.868307692297" }, { "月份": "12", "月平均排放量": "44007057.53593331" }] },
    { "企业名称": "哈尔滨热电", "企业编码": "150300000019", "行业": "电厂", "排放总量": 55315243381051.484, "月数据": [{ "月份": "1", "月平均排放量": "121538692264.5229" }, { "月份": "2", "月平均排放量": "170107489656.96585" }, { "月份": "3", "月平均排放量": "104863183563.5245" }, { "月份": "4", "月平均排放量": "20999507336.59112" }, { "月份": "5", "月平均排放量": "12011.565259615385" }, { "月份": "6", "月平均排放量": "17341.869749999998" }, { "月份": "7", "月平均排放量": "41359483277.238884" }, { "月份": "8", "月平均排放量": "64079466473.51856" }, { "月份": "9", "月平均排放量": "11073.344574999995" }, { "月份": "10", "月平均排放量": "20112.72456730769" }, { "月份": "11", "月平均排放量": "20273.528727272732" }, { "月份": "12", "月平均排放量": "19772.626926829267" }] },
    { "企业名称": "捷能热力电站(延寿)", "企业编码": "150300000030", "行业": "电厂", "排放总量": 22813249.855, "月数据": [{ "月份": "1", "月平均排放量": "0" }, { "月份": "2", "月平均排放量": "0" }, { "月份": "3", "月平均排放量": "0" }, { "月份": "4", "月平均排放量": "1822.48516" }, { "月份": "5", "月平均排放量": "71808.5334074074" }, { "月份": "6", "月平均排放量": "46680.63792307693" }, { "月份": "7", "月平均排放量": "109001.05996666664" }, { "月份": "8", "月平均排放量": "12069.70414285714" }, { "月份": "9", "月平均排放量": "111914.58838235294" }, { "月份": "11", "月平均排放量": "109750.40420408167" }, { "月份": "12", "月平均排放量": "151341.23203389833" }] },
    { "企业名称": "亚泰集团", "企业编码": "150400000024", "行业": "水泥", "排放总量": 180456669.8569999, "月数据": [{ "月份": "1", "月平均排放量": "344235.44418253965" }, { "月份": "2", "月平均排放量": "111591.28903488375" }, { "月份": "3", "月平均排放量": "176735.18786324793" }, { "月份": "4", "月平均排放量": "71406.39830147056" }, { "月份": "5", "月平均排放量": "43189.11804761906" }, { "月份": "6", "月平均排放量": "514636.19095138897" }, { "月份": "7", "月平均排放量": "19311.338927631583" }, { "月份": "8", "月平均排放量": "38381.82574358974" }, { "月份": "9", "月平均排放量": "50606.72018115942" }, { "月份": "10", "月平均排放量": "5966.095601626018" }, { "月份": "11", "月平均排放量": "0.06083941605839415" }, { "月份": "12", "月平均排放量": "19703.196074074072" }] },
    { "企业名称": "三联药业", "企业编码": "150400000025", "行业": "医药", "排放总量": 10965019.11000005, "月数据": [{ "月份": "1", "月平均排放量": "21652.315041095888" }, { "月份": "2", "月平均排放量": "104656.73360784311" }, { "月份": "3", "月平均排放量": "46465.548174418625" }, { "月份": "4", "月平均排放量": "58.942404761904754" }, { "月份": "5", "月平均排放量": "102.81143820224721" }, { "月份": "6", "月平均排放量": "179.14760869565214" }, { "月份": "7", "月平均排放量": "8.080016666666663" }, { "月份": "8", "月平均排放量": "27.929580000000005" }, { "月份": "9", "月平均排放量": "35.48574747474748" }, { "月份": "10", "月平均排放量": "82.11851282051282" }, { "月份": "11", "月平均排放量": "137.3759012345679" }, { "月份": "12", "月平均排放量": "82.44032222222222" }] },
    { "企业名称": "哈啤", "企业编码": "150500000012", "行业": "其他", "排放总量": 33995457515.27001, "月数据": [{ "月份": "1", "月平均排放量": "545542182.6353062" }, { "月份": "2", "月平均排放量": "864724.7248400001" }, { "月份": "3", "月平均排放量": "147154.95152459017" }, { "月份": "4", "月平均排放量": "391342.2137600001" }, { "月份": "5", "月平均排放量": "391526.01698148134" }, { "月份": "6", "月平均排放量": "177056.38882978723" }, { "月份": "7", "月平均排放量": "49313.92271428571" }, { "月份": "8", "月平均排放量": "212721.95266129036" }, { "月份": "9", "月平均排放量": "498300.1882499999" }, { "月份": "10", "月平均排放量": "77644.43945833333" }, { "月份": "11", "月平均排放量": "335526.60800000006" }, { "月份": "12", "月平均排放量": "772045.4628035715" }] }
];


var comMonthTotalVal_xx = [
    { "企业名称": "鑫玛热电(木兰)", "月份": 10, "月排放总量": 1744930, "日排放量": [{ "day": 1, "value": 142056.76499999998 }, { "day": 2, "value": 94821.14 }, { "day": 3, "value": 138978.569 }, { "day": 4, "value": 146961.537 }, { "day": 5, "value": 185212.938 }, { "day": 6, "value": 175662.754 }, { "day": 7, "value": 107788.019 }, { "day": 8, "value": 84243.755 }, { "day": 9, "value": 83073.007 }, { "day": 10, "value": 67225.509 }, { "day": 11, "value": null }, { "day": 12, "value": null }, { "day": 13, "value": null }, { "day": 14, "value": null }, { "day": 15, "value": null }, { "day": 16, "value": null }, { "day": 17, "value": null }, { "day": 18, "value": null }, { "day": 19, "value": null }, { "day": 20, "value": null }, { "day": 21, "value": null }, { "day": 22, "value": null }, { "day": 23, "value": null }, { "day": 24, "value": null }, { "day": 25, "value": 82753.156 }, { "day": 26, "value": 83754.274 }, { "day": 27, "value": 63473.764 }, { "day": 28, "value": 81383.481 }, { "day": 29, "value": 67371.25600000001 }, { "day": 30, "value": 63381.286 }, { "day": 31, "value": 76770.747 }] },
    { "企业名称": "西林钢铁", "月份": 10, "月排放总量": 320914, "日排放量": [{ "day": 1, "value": 9252.438 }, { "day": 2, "value": 9774.765 }, { "day": 3, "value": 9454.573999999998 }, { "day": 4, "value": 13125.743999999998 }, { "day": 5, "value": 16620.718 }, { "day": 6, "value": 20445.953 }, { "day": 7, "value": 21071.440000000002 }, { "day": 8, "value": 19692.289 }, { "day": 9, "value": 20090.675 }, { "day": 10, "value": 18200.048 }, { "day": 11, "value": null }, { "day": 12, "value": null }, { "day": 13, "value": null }, { "day": 14, "value": null }, { "day": 15, "value": null }, { "day": 16, "value": null }, { "day": 17, "value": null }, { "day": 18, "value": null }, { "day": 19, "value": null }, { "day": 20, "value": null }, { "day": 21, "value": null }, { "day": 22, "value": null }, { "day": 23, "value": null }, { "day": 24, "value": null }, { "day": 25, "value": null }, { "day": 26, "value": 25425.5 }, { "day": 27, "value": 24995.152 }, { "day": 28, "value": 26421.051 }, { "day": 29, "value": 25384.251 }, { "day": 30, "value": 30665.851 }, { "day": 31, "value": 30276.433999999997 }] },
    { "企业名称": "地丰涤纶", "月份": 10, "月排放总量": 25990110, "日排放量": [{ "day": 1, "value": 415361.87600000004 }, { "day": 2, "value": 544379.406 }, { "day": 3, "value": 1357868.712 }, { "day": 4, "value": 5336231.7 }, { "day": 5, "value": 1957773.4360000002 }, { "day": 6, "value": 1238552.699 }, { "day": 7, "value": 1788333.9130000001 }, { "day": 8, "value": 1998997.258 }, { "day": 9, "value": 1566028.19 }, { "day": 10, "value": 1777281.619 }, { "day": 11, "value": null }, { "day": 12, "value": null }, { "day": 13, "value": null }, { "day": 14, "value": null }, { "day": 15, "value": null }, { "day": 16, "value": null }, { "day": 17, "value": null }, { "day": 18, "value": null }, { "day": 19, "value": null }, { "day": 20, "value": null }, { "day": 21, "value": null }, { "day": 22, "value": null }, { "day": 23, "value": null }, { "day": 24, "value": null }, { "day": 25, "value": null }, { "day": 26, "value": 2151902.786 }, { "day": 27, "value": 1381804.386 }, { "day": 28, "value": 1127699.281 }, { "day": 29, "value": 1203264.428 }, { "day": 30, "value": 991640.3769999999 }, { "day": 31, "value": 1152924.748 }] },
    { "企业名称": "鑫玛热电(宾县)", "月份": 10, "月排放总量": 120596808, "日排放量": [{ "day": 1, "value": 2139337.125 }, { "day": 2, "value": 2298260.988 }, { "day": 3, "value": 2679050.136 }, { "day": 4, "value": 2579994.0280000004 }, { "day": 5, "value": 1945343.886 }, { "day": 6, "value": 2572465.947 }, { "day": 7, "value": 1739869.972 }, { "day": 8, "value": 2149991.4220000002 }, { "day": 9, "value": 1448187.663 }, { "day": 10, "value": null }, { "day": 11, "value": null }, { "day": 12, "value": null }, { "day": 13, "value": null }, { "day": 14, "value": null }, { "day": 15, "value": null }, { "day": 16, "value": null }, { "day": 17, "value": null }, { "day": 18, "value": null }, { "day": 19, "value": null }, { "day": 20, "value": null }, { "day": 21, "value": null }, { "day": 22, "value": null }, { "day": 23, "value": null }, { "day": 24, "value": null }, { "day": 25, "value": 25816612.672 }, { "day": 26, "value": 13570555.243999999 }, { "day": 27, "value": 19470692.128 }, { "day": 28, "value": 8157065.453 }, { "day": 29, "value": 12775543.862000001 }, { "day": 30, "value": 16666482.631 }, { "day": 31, "value": 4587330.301000001 }] },
    { "企业名称": "宾州水泥", "月份": 10, "月排放总量": 6858689, "日排放量": [{ "day": 1, "value": 198157.95 }, { "day": 2, "value": 161354.529 }, { "day": 3, "value": 191546.875 }, { "day": 4, "value": 197361.585 }, { "day": 5, "value": 224457.994 }, { "day": 6, "value": 220816.749 }, { "day": 7, "value": 225278.08500000002 }, { "day": 8, "value": 144874.054 }, { "day": 9, "value": 355370.144 }, { "day": 10, "value": null }, { "day": 11, "value": null }, { "day": 12, "value": null }, { "day": 13, "value": null }, { "day": 14, "value": null }, { "day": 15, "value": null }, { "day": 16, "value": null }, { "day": 17, "value": null }, { "day": 18, "value": null }, { "day": 19, "value": null }, { "day": 20, "value": null }, { "day": 21, "value": null }, { "day": 22, "value": null }, { "day": 23, "value": null }, { "day": 24, "value": null }, { "day": 25, "value": 667937.6329999999 }, { "day": 26, "value": 672465.59 }, { "day": 27, "value": 741564.557 }, { "day": 28, "value": 744378.561 }, { "day": 29, "value": 704246.2399999999 }, { "day": 30, "value": 651172.1849999999 }, { "day": 31, "value": 757682.104 }] },
    { "企业名称": "哈尔滨第三发电厂", "月份": 10, "月排放总量": 2541007881, "日排放量": [{ "day": 1, "value": 1673578.6620000002 }, { "day": 2, "value": 1585682.082 }, { "day": 3, "value": 1787606.6600000001 }, { "day": 4, "value": 1458362.233 }, { "day": 5, "value": 1523144.083 }, { "day": 6, "value": 1223096.058 }, { "day": 7, "value": 1286819.652 }, { "day": 8, "value": 1324297.662 }, { "day": 9, "value": 1222503.26 }, { "day": 10, "value": null }, { "day": 11, "value": null }, { "day": 12, "value": null }, { "day": 13, "value": null }, { "day": 14, "value": 539244464.506 }, { "day": 15, "value": 250994100.338 }, { "day": 16, "value": 254997331.41 }, { "day": 17, "value": 317306957.60300004 }, { "day": 18, "value": 468487294.90000003 }, { "day": 19, "value": 280336756.152 }, { "day": 20, "value": 414594900.38 }, { "day": 21, "value": 277864.204 }, { "day": 22, "value": 280959.928 }, { "day": 23, "value": 276582.004 }, { "day": 24, "value": 280630.595 }, { "day": 25, "value": 286694.7 }, { "day": 26, "value": 291287.787 }, { "day": 27, "value": 266921.591 }, { "day": 28, "value": 0.028 }, { "day": 29, "value": null }, { "day": 30, "value": null }, { "day": 31, "value": null }] },
    { "企业名称": "中龙热电", "月份": 10, "月排放总量": 163770738, "日排放量": [{ "day": 1, "value": 8476991.852 }, { "day": 2, "value": 7522387.7639999995 }, { "day": 3, "value": 9571721.238 }, { "day": 4, "value": 11096458.177 }, { "day": 5, "value": 7553656.966 }, { "day": 6, "value": 6628883.571 }, { "day": 7, "value": 7664722.882 }, { "day": 8, "value": 7924742.148 }, { "day": 9, "value": 8233722.337 }, { "day": 10, "value": 9570778.879999999 }, { "day": 11, "value": null }, { "day": 12, "value": null }, { "day": 13, "value": null }, { "day": 14, "value": null }, { "day": 15, "value": 7891517.92 }, { "day": 16, "value": 6843886.486 }, { "day": 17, "value": 8393100.015 }, { "day": 18, "value": 11971704.405 }, { "day": 19, "value": null }, { "day": 20, "value": null }, { "day": 21, "value": null }, { "day": 22, "value": null }, { "day": 23, "value": null }, { "day": 24, "value": null }, { "day": 25, "value": 11032860.016 }, { "day": 26, "value": 11776457.021000001 }, { "day": 27, "value": 8603753.104 }, { "day": 28, "value": null }, { "day": 29, "value": 6692479.645 }, { "day": 30, "value": 6320891.55 }, { "day": 31, "value": 0 }] },
    { "企业名称": "哈药集团制药总厂", "月份": 10, "月排放总量": 10033672, "日排放量": [{ "day": 1, "value": 239163.574 }, { "day": 2, "value": 235233.799 }, { "day": 3, "value": 237218.202 }, { "day": 4, "value": 319060.55799999996 }, { "day": 5, "value": 315667.04600000003 }, { "day": 6, "value": 289971.758 }, { "day": 7, "value": 315285.483 }, { "day": 8, "value": 311227.245 }, { "day": 9, "value": 229042.138 }, { "day": 10, "value": null }, { "day": 11, "value": null }, { "day": 12, "value": null }, { "day": 13, "value": null }, { "day": 14, "value": 301972.522 }, { "day": 15, "value": 209524.613 }, { "day": 16, "value": 223425.95799999998 }, { "day": 17, "value": 145822.61800000002 }, { "day": 18, "value": 145589.97600000002 }, { "day": 19, "value": null }, { "day": 20, "value": null }, { "day": 21, "value": null }, { "day": 22, "value": null }, { "day": 23, "value": null }, { "day": 24, "value": 205670.537 }, { "day": 25, "value": 204911.278 }, { "day": 26, "value": 140199.70500000002 }, { "day": 27, "value": 139712.474 }, { "day": 28, "value": 205631.934 }, { "day": 29, "value": 294820.7 }, { "day": 30, "value": 3175128.857 }, { "day": 31, "value": 2149355.2750000004 }] },
    { "企业名称": "中煤龙化（煤化工）", "月份": 10, "月排放总量": 17942898, "日排放量": [{ "day": 1, "value": 1538356.4670000001 }, { "day": 2, "value": 1557018.504 }, { "day": 3, "value": 1835982.7989999998 }, { "day": 4, "value": 1906927.969 }, { "day": 5, "value": 2096661.0929999998 }, { "day": 6, "value": 1501798.061 }, { "day": 7, "value": 1436158.324 }, { "day": 8, "value": 1345087.124 }, { "day": 9, "value": 1255897.866 }, { "day": 10, "value": 1207095.562 }, { "day": 11, "value": 65046.518 }, { "day": 12, "value": null }, { "day": 13, "value": null }, { "day": 14, "value": 51986.34 }, { "day": 15, "value": 228763.256 }, { "day": 16, "value": 154370.00199999998 }, { "day": 17, "value": 147029.32700000002 }, { "day": 18, "value": 197089.543 }, { "day": 19, "value": 343241.372 }, { "day": 20, "value": 140214.164 }, { "day": 21, "value": 165129.539 }, { "day": 22, "value": 44557.934 }, { "day": 23, "value": 50363.181 }, { "day": 24, "value": 104210.456 }, { "day": 25, "value": 52829.946 }, { "day": 26, "value": 67503.533 }, { "day": 27, "value": 59787.394 }, { "day": 28, "value": 32225.432 }, { "day": 29, "value": 69925.904 }, { "day": 30, "value": 183811.489 }, { "day": 31, "value": 103792.888 }] },
    { "企业名称": "东安发动机", "月份": 10, "月排放总量": 111092610, "日排放量": [{ "day": 1, "value": 3611306.096 }, { "day": 2, "value": 3268318.196 }, { "day": 3, "value": 3578466.9460000004 }, { "day": 4, "value": 3868994.5700000003 }, { "day": 5, "value": 3945522.411 }, { "day": 6, "value": 3943076.202 }, { "day": 7, "value": 3511259.813 }, { "day": 8, "value": 3885850.695 }, { "day": 9, "value": 4574644.545 }, { "day": 10, "value": 5965331.3950000005 }, { "day": 11, "value": null }, { "day": 12, "value": null }, { "day": 13, "value": null }, { "day": 14, "value": null }, { "day": 15, "value": 4596896.687000001 }, { "day": 16, "value": 5159049.361 }, { "day": 17, "value": 5098462.499 }, { "day": 18, "value": 5094993.806 }, { "day": 19, "value": 5363392.098999999 }, { "day": 20, "value": 5175974.799000001 }, { "day": 21, "value": 5031890.904999999 }, { "day": 22, "value": 2977384.1029999996 }, { "day": 23, "value": 2502454.2389999996 }, { "day": 24, "value": 2138635.621 }, { "day": 25, "value": 3115421.124 }, { "day": 26, "value": 4491605.825999999 }, { "day": 27, "value": 3960243.281 }, { "day": 28, "value": 4125348.519 }, { "day": 29, "value": 4408171.257 }, { "day": 30, "value": 3780922.295 }, { "day": 31, "value": 3918905.0289999996 }] },
    { "企业名称": "哈尔滨第一热电厂", "月份": 10, "月排放总量": 20922873, "日排放量": [{ "day": 1, "value": 525305.014 }, { "day": 2, "value": 335642.53800000005 }, { "day": 3, "value": 1005932.4670000001 }, { "day": 4, "value": 136776.289 }, { "day": 5, "value": 822196.106 }, { "day": 6, "value": 622861.724 }, { "day": 7, "value": 592682.799 }, { "day": 8, "value": 412300.051 }, { "day": 9, "value": 605870.856 }, { "day": 10, "value": 1114482.117 }, { "day": 11, "value": null }, { "day": 12, "value": null }, { "day": 13, "value": null }, { "day": 14, "value": null }, { "day": 15, "value": 468648.286 }, { "day": 16, "value": 962002.9369999999 }, { "day": 17, "value": 1073955.685 }, { "day": 18, "value": 1794988.548 }, { "day": 19, "value": 699036.117 }, { "day": 20, "value": null }, { "day": 21, "value": 646710.593 }, { "day": 22, "value": null }, { "day": 23, "value": null }, { "day": 24, "value": null }, { "day": 25, "value": 1795038.5869999998 }, { "day": 26, "value": 1031181.122 }, { "day": 27, "value": 1136707.64 }, { "day": 28, "value": 1082766.744 }, { "day": 29, "value": 972477.783 }, { "day": 30, "value": 934945.575 }, { "day": 31, "value": 2150332.2339999997 }] },
    { "企业名称": "东方热电", "月份": 10, "月排放总量": 2904030, "日排放量": [{ "day": 1, "value": 66938.524 }, { "day": 2, "value": 69207.031 }, { "day": 3, "value": 179146.28900000002 }, { "day": 4, "value": 135691.387 }, { "day": 5, "value": 445857.892 }, { "day": 6, "value": 90067.089 }, { "day": 7, "value": 75606.01999999999 }, { "day": 8, "value": 38934.962 }, { "day": 9, "value": 102010.20700000001 }, { "day": 10, "value": 5922.645 }, { "day": 11, "value": null }, { "day": 12, "value": null }, { "day": 13, "value": null }, { "day": 14, "value": 135469.342 }, { "day": 15, "value": 77868.313 }, { "day": 16, "value": 28437.837 }, { "day": 17, "value": 128528.447 }, { "day": 18, "value": 143455.62 }, { "day": 19, "value": 63106.060999999994 }, { "day": 20, "value": 195735.034 }, { "day": 21, "value": 65758.789 }, { "day": 22, "value": 67745.94900000001 }, { "day": 23, "value": 47878.426999999996 }, { "day": 24, "value": 82832.40000000001 }, { "day": 25, "value": 165532.614 }, { "day": 26, "value": 53544.045 }, { "day": 27, "value": 103891.07999999998 }, { "day": 28, "value": 70494.573 }, { "day": 29, "value": 113731.038 }, { "day": 30, "value": 79395.74900000001 }, { "day": 31, "value": 71216.418 }] },
    { "企业名称": "哈飞工业集团", "月份": 10, "月排放总量": 1053736, "日排放量": [{ "day": 1, "value": 41712.534 }, { "day": 2, "value": 37965.762 }, { "day": 3, "value": 38691.880000000005 }, { "day": 4, "value": 39502.187000000005 }, { "day": 5, "value": 42908.844 }, { "day": 6, "value": 44116.202999999994 }, { "day": 7, "value": 43035.880000000005 }, { "day": 8, "value": 40753.545 }, { "day": 9, "value": 44473.588 }, { "day": 10, "value": 44503.537 }, { "day": 11, "value": null }, { "day": 12, "value": null }, { "day": 13, "value": null }, { "day": 14, "value": null }, { "day": 15, "value": 40206.765 }, { "day": 16, "value": 41918.742 }, { "day": 17, "value": 41999.257 }, { "day": 18, "value": 42656.073000000004 }, { "day": 19, "value": 44633.454 }, { "day": 20, "value": 37253.516 }, { "day": 21, "value": 26517.015 }, { "day": 22, "value": 33732.066999999995 }, { "day": 23, "value": 42374.035 }, { "day": 24, "value": 42593.826 }, { "day": 25, "value": 32749.73 }, { "day": 26, "value": 29689.262000000002 }, { "day": 27, "value": 32759.911 }, { "day": 28, "value": 33413.460999999996 }, { "day": 29, "value": 33963.505 }, { "day": 30, "value": 40915.719 }, { "day": 31, "value": 38665.29 }] },
    { "企业名称": "哈投热电厂", "月份": 10, "月排放总量": 5434549, "日排放量": [{ "day": 1, "value": 654257.5349999999 }, { "day": 2, "value": 498683.038 }, { "day": 3, "value": 493181.73699999996 }, { "day": 4, "value": 313114.783 }, { "day": 5, "value": 334963.7 }, { "day": 6, "value": 335262.262 }, { "day": 7, "value": 216641.419 }, { "day": 8, "value": 171027.85700000002 }, { "day": 9, "value": 405647.445 }, { "day": 10, "value": 208821.779 }, { "day": 11, "value": null }, { "day": 12, "value": null }, { "day": 13, "value": null }, { "day": 14, "value": null }, { "day": 15, "value": 172233.84 }, { "day": 16, "value": 48811.599 }, { "day": 17, "value": 34993.711 }, { "day": 18, "value": 96043.493 }, { "day": 19, "value": 104648.15400000001 }, { "day": 20, "value": 179815.278 }, { "day": 21, "value": 82759.919 }, { "day": 22, "value": 92573.925 }, { "day": 23, "value": 48740.641 }, { "day": 24, "value": 119787.64799999998 }, { "day": 25, "value": 120574.261 }, { "day": 26, "value": 115285.32500000001 }, { "day": 27, "value": 105448.611 }, { "day": 28, "value": 131460.229 }, { "day": 29, "value": 115298.051 }, { "day": 30, "value": 91944.41699999998 }, { "day": 31, "value": 142498.587 }] },
    { "企业名称": "达尔凯阳光（哈尔滨）", "月份": 10, "月排放总量": 823191, "日排放量": [{ "day": 1, "value": 22301.334 }, { "day": 2, "value": 20173.512 }, { "day": 3, "value": 23600.494 }, { "day": 4, "value": 16453.434 }, { "day": 5, "value": 14852.131 }, { "day": 6, "value": 13677.431 }, { "day": 7, "value": 13778.012 }, { "day": 8, "value": null }, { "day": 9, "value": 1600.94 }, { "day": 10, "value": 30519.321 }, { "day": 11, "value": null }, { "day": 12, "value": null }, { "day": 13, "value": null }, { "day": 14, "value": null }, { "day": 15, "value": 36258.929 }, { "day": 16, "value": 12148.826 }, { "day": 17, "value": 12918.891 }, { "day": 18, "value": 27747.811999999998 }, { "day": 19, "value": 30434.419 }, { "day": 20, "value": 27038.182999999997 }, { "day": 21, "value": 22001.677 }, { "day": 22, "value": 30749.097999999998 }, { "day": 23, "value": 19730.64 }, { "day": 24, "value": 32245.61 }, { "day": 25, "value": 94852.648 }, { "day": 26, "value": 34815.924 }, { "day": 27, "value": 56453.486000000004 }, { "day": 28, "value": 78241.058 }, { "day": 29, "value": 62776.998999999996 }, { "day": 30, "value": 44763.354 }, { "day": 31, "value": 43034.688 }] },
    { "企业名称": "哈尔滨热电", "月份": 10, "月排放总量": 2091749, "日排放量": [{ "day": 1, "value": 76208.554 }, { "day": 2, "value": 40612.187 }, { "day": 3, "value": 43875.086 }, { "day": 4, "value": 51611.011999999995 }, { "day": 5, "value": 32920.049 }, { "day": 6, "value": 46737.838 }, { "day": 7, "value": 54238.06 }, { "day": 8, "value": 94041.618 }, { "day": 9, "value": 76827.167 }, { "day": 10, "value": 103645.283 }, { "day": 11, "value": 118767.488 }, { "day": 12, "value": null }, { "day": 13, "value": null }, { "day": 14, "value": null }, { "day": 15, "value": null }, { "day": 16, "value": 95346.36 }, { "day": 17, "value": 78283.122 }, { "day": 18, "value": 71145.99 }, { "day": 19, "value": 71187.084 }, { "day": 20, "value": 80840.087 }, { "day": 21, "value": 78196.063 }, { "day": 22, "value": 184565.848 }, { "day": 23, "value": 89627.631 }, { "day": 24, "value": null }, { "day": 25, "value": 93323.21299999999 }, { "day": 26, "value": 90278.793 }, { "day": 27, "value": 93856.199 }, { "day": 28, "value": 132063.435 }, { "day": 29, "value": 96401.842 }, { "day": 30, "value": 63514.283 }, { "day": 31, "value": 33609.063 }] },
    { "企业名称": "捷能热力电站(延寿)", "月份": 10, "月排放总量": 0, "日排放量": [{ "day": 1, "value": null }, { "day": 2, "value": null }, { "day": 3, "value": null }, { "day": 4, "value": null }, { "day": 5, "value": null }, { "day": 6, "value": null }, { "day": 7, "value": null }, { "day": 8, "value": null }, { "day": 9, "value": null }, { "day": 10, "value": null }, { "day": 11, "value": null }, { "day": 12, "value": null }, { "day": 13, "value": null }, { "day": 14, "value": null }, { "day": 15, "value": null }, { "day": 16, "value": null }, { "day": 17, "value": null }, { "day": 18, "value": null }, { "day": 19, "value": null }, { "day": 20, "value": null }, { "day": 21, "value": null }, { "day": 22, "value": null }, { "day": 23, "value": null }, { "day": 24, "value": null }, { "day": 25, "value": null }, { "day": 26, "value": null }, { "day": 27, "value": null }, { "day": 28, "value": null }, { "day": 29, "value": null }, { "day": 30, "value": null }, { "day": 31, "value": null }] },
    { "企业名称": "亚泰集团", "月份": 10, "月排放总量": 733930, "日排放量": [{ "day": 1, "value": 2594.6420000000003 }, { "day": 2, "value": 13562.648000000001 }, { "day": 3, "value": 86570.995 }, { "day": 4, "value": 67969.135 }, { "day": 5, "value": 53007.520000000004 }, { "day": 6, "value": 121487.31599999999 }, { "day": 7, "value": 146064.82 }, { "day": 8, "value": 116843.576 }, { "day": 9, "value": 54249.879 }, { "day": 10, "value": 22578.565 }, { "day": 11, "value": 48900.273 }, { "day": 12, "value": null }, { "day": 13, "value": null }, { "day": 14, "value": null }, { "day": 15, "value": 0.013999999999999998 }, { "day": 16, "value": 0.021 }, { "day": 17, "value": 0.020999999999999998 }, { "day": 18, "value": 0.024999999999999998 }, { "day": 19, "value": 0.033999999999999995 }, { "day": 20, "value": 0.023 }, { "day": 21, "value": 0.046000000000000006 }, { "day": 22, "value": 0.016 }, { "day": 23, "value": 0.013000000000000001 }, { "day": 24, "value": 0.012 }, { "day": 25, "value": 0.018 }, { "day": 26, "value": 0.023 }, { "day": 27, "value": 0.02 }, { "day": 28, "value": 0.035 }, { "day": 29, "value": 0.023 }, { "day": 30, "value": 0.019 }, { "day": 31, "value": 0.026999999999999996 }] },
    { "企业名称": "三联药业", "月份": 10, "月排放总量": 6444, "日排放量": [{ "day": 1, "value": 68.72399999999999 }, { "day": 2, "value": 196.575 }, { "day": 3, "value": 217.981 }, { "day": 4, "value": 165.42 }, { "day": 5, "value": 41.104 }, { "day": 6, "value": 21.872 }, { "day": 7, "value": 29.548000000000002 }, { "day": 8, "value": 32.533 }, { "day": 9, "value": 106.715 }, { "day": 10, "value": 179.508 }, { "day": 11, "value": null }, { "day": 12, "value": null }, { "day": 13, "value": null }, { "day": 14, "value": null }, { "day": 15, "value": 0 }, { "day": 16, "value": 129.823 }, { "day": 17, "value": 31.07 }, { "day": 18, "value": 16.789 }, { "day": 19, "value": 277.3 }, { "day": 20, "value": 474.071 }, { "day": 21, "value": 471.94899999999995 }, { "day": 22, "value": 447.24700000000007 }, { "day": 23, "value": 427.8349999999999 }, { "day": 24, "value": 376.098 }, { "day": 25, "value": 427.411 }, { "day": 26, "value": 446.683 }, { "day": 27, "value": 518.7760000000001 }, { "day": 28, "value": 528.479 }, { "day": 29, "value": 432.25800000000003 }, { "day": 30, "value": 339.475 }, { "day": 31, "value": 0 }] },
    { "企业名称": "哈啤", "月份": 10, "月排放总量": 3726946, "日排放量": [{ "day": 1, "value": 2936.435 }, { "day": 2, "value": 0 }, { "day": 3, "value": 0 }, { "day": 4, "value": 0 }, { "day": 5, "value": 0 }, { "day": 6, "value": 0 }, { "day": 7, "value": 0 }, { "day": 8, "value": 554.053 }, { "day": 9, "value": 5.762 }, { "day": 10, "value": 7.299 }, { "day": 11, "value": null }, { "day": 12, "value": null }, { "day": 13, "value": null }, { "day": 14, "value": null }, { "day": 15, "value": 11.535 }, { "day": 16, "value": 25.216 }, { "day": 17, "value": 25.058 }, { "day": 18, "value": 20.66 }, { "day": 19, "value": 7.388 }, { "day": 20, "value": 8.506 }, { "day": 21, "value": 22.048 }, { "day": 22, "value": 6069.589 }, { "day": 23, "value": 590640.0730000001 }, { "day": 24, "value": 758396.982 }, { "day": 25, "value": 753099.2050000001 }, { "day": 26, "value": 956078.616 }, { "day": 27, "value": 657986.173 }, { "day": 28, "value": 1038.495 }, { "day": 29, "value": 0 }, { "day": 30, "value": 0 }, { "day": 31, "value": 0.001 }] }
];



var so2CityOneDayArr_xxx = function (year, month, day) {
    var cityDailyArr = new Array(), arr = new Array();
    for (var i = 0; i < posList.length ; i++) {
        var ar = posDataH.filter(function (v) {
            var time = v["MonitorTime"];
            var date = new Date(time.split(" ")[0]);
            return (v["点位编码"] == posList[i]["编码"] && year == date.getFullYear() && month == date.getMonth() + 1 && day == date.getDate());
        });
        arr.push(ar);
    }
    for (var i = 0; i < 24; i++) {
        var total = 0, validPos = 0;
        for (var j = 0; j < arr.length; j++) {
            if (typeof arr[j][i] != "undefined" && typeof arr[j][i]["监测值"] != "undefined") {
                total += (arr[j][i]["监测值"] == "" ? 0 : parseFloat(arr[j][i]["监测值"]));
                ++validPos;
            }
        }
        cityDailyArr.push({ day: day, hour: i + "时", value: (validPos == 0 ? null : total / validPos) });
    }
    return cityDailyArr;
}

var posOneDayArr_xxx = function (year, month, day) {
    var posDailyArr = new Array();
    for (var i = 0; i < posList.length ; i++) {
        var posName = posList[i]["站点名称"];
        var ar = posDataH.filter(function (v) {
            var time = v["MonitorTime"];
            var date = new Date(time.split(" ")[0]);
            return (v["点位编码"] == posList[i]["编码"] && year == date.getFullYear() && month == date.getMonth() + 1 && day == date.getDate());
        });
        var hourDataArr = new Array();
        ar.forEach(function (val, index, arry) {
            var t = val["MonitorTime"];
            var d = new Date(t.split(" ")[0]);
            d.setHours(t.split(" ")[1].split(":")[0]);
            var h = d.getHours();
            hourDataArr.push({ hour: h + "时", value: val["监测值"] == "" ? 0 : parseFloat(val["监测值"]) });
        })
        posDailyArr.push({ "站点名称": posName, "日期": day, "小时数据": hourDataArr });
    }
    return posDailyArr;
}


var posDailyAveVal_xxx = function (year, month) {
    function getPosName(posId) {
        var posName;
        for (var i = 0; i < posList.length; i++) {
            if (posId == posList[i]["编码"]) {
                posName = posList[i]["站点名称"];
                break;
            }
        }
        return posName;
    }

    var arr = new Array(), retValue = new Array(), daysInMonth = getDaysInMonth(year, month);
    for (var i = 0; i < posList.length ; i++) {
        var ar = posDataH.filter(function (v) {
            var time = v["MonitorTime"];
            var date = new Date(time.split(" ")[0]);
            return (v["点位编码"] == posList[i]["编码"] && date.getMonth() + 1 == month && date.getDate() <= 27);
        });
        arr.push(ar);
    }
    for (var i = 0; i < arr.length; i++) {
        var total = 0, validPos = 0, posName;
        arr[i].forEach(function (v, i, arr) {
            posName = getPosName(v["点位编码"]);
            total += (v["监测值"] == "" ? 0 : parseFloat(v["监测值"]));
            ++validPos;
        });
        retValue.push({ "站点名称": posName, "站点当月均值": parseFloat((validPos == 0 ? null : total / validPos).toFixed(5)) })
    }
    return retValue;
}


var comMonthOneDayData_xxx = function (year, month, day) {
    function getIndustry(comName) {
        var industry;
        for (var i = 0; i < comList.length; i++) {
            if (comName == comList[i]["企业名称"]) {
                industry = comList[i]["行业"];
                break;
            }
        }
        return industry;
    }

    var comArr = new Array();
    for (var i = 0; i < comList.length; i++) {
        var comName = comList[i]["企业名称"], array = new Array();
        var ar = comDataH.filter(function (v) {
            var time = v.Time;
            var date = new Date(time.split(" ")[0]);
            return (v["企业编码"] == comList[i]["企业编码"] && year == date.getFullYear() && month == date.getMonth() + 1 && day == date.getDate());
        });
        for (var j = 0; j < 24; j++) {
            var hour = j, valPos = 0, total = 0;
            var ar2 = ar.filter(function (v) {
                var t = v.Time;
                var d = new Date(t.split(" ")[0]);
                d.setHours(t.split(" ")[1].split(":")[0]);
                var h = d.getHours();
                return hour == h;
            });
            ar2.forEach(function (v, i, arr) {
                total += v["累计排放量"] == "" ? 0 : parseFloat(v["累计排放量"]);
                ++valPos;
            });
            array.push({ "时间": hour + "时", "小时累计排量": total, "小时均排量": valPos == 0 ? null : parseFloat((total / valPos).toFixed(3)) })
        }
        comArr.push({ "企业名称": comName, "行业": getIndustry(comName), "日期": day.toString(), "小时数据": array });
    }
    return comArr;
}

var industryDayData_xxx = function (year, month, day) {
    var industryTotalArr = [], dayString = day.toString(), allTotal = 0, percent = 0;
    industryType.forEach(function (value, index, array) {
        var total = 0;
        comMonthOneDayData.filter(function (v) {
            return v["行业"] == value && v["日期"] == dayString;
        }).forEach(function (val, ind, arr) {
            val["小时数据"].forEach(function (v, i, ar) {
                total += parseFloat(v["小时累计排量"].toFixed(3));
            });
        });
        allTotal += total;
        industryTotalArr.push({ "行业": value, "日排放量": total });
    });
    industryTotalArr.sort(function (a, b) {
        return a["日排放量"] >= b["日排放量"] ? -1 : 1;
    }).forEach(function (value, index, array) {
        if (index != array.length - 1) {
            var per = value["日排放量"] / allTotal;
            percent += per;
            value["日排放比例"] = per;
        } else {
            value["日排放比例"] = 1 - percent;
        }
    });
    return industryTotalArr;
}

var comDayTotalVal_xxx = function (year, month, day) {
    var comTotalArr = [], dayString = day.toString();
    for (var i = 0; i < comList.length; i++) {
        var comName = comList[i]["企业名称"];
        var arr = comMonthOneDayData.filter(function (v) {
            return v["企业名称"] == comName && v["日期"] == dayString;
        });
        arr.forEach(function (value, index, array) {
            var hourData = value["小时数据"], total = 0;
            hourData.forEach(function (vv, ind, arr) {
                total += parseFloat(vv["小时累计排量"].toFixed(3));
            });
            comTotalArr.push({ "企业名称": comName, "日排放量": total });
        });
    }
    return comTotalArr;
}